name: "ensemble_trt"
platform: "ensemble"
max_batch_size: 32

input [
  {
    name: "raw_image"
    data_type: TYPE_UINT8
    dims: [ -1 ]
  }
]

output [
  {
    name: "predictions"
    data_type: TYPE_FP32
    dims: [ 589 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "image_preprocessor"
      model_version: -1
      input_map {
        key: "input_image"
        value: "raw_image"
      }
      output_map {
        key: "processed_tensor"
        value: "preprocessed"
      }
    },
    {
      model_name: "trt"
      model_version: -1
      input_map {
        key: "input"
        value: "preprocessed"
      }
      output_map {
        key: "output"
        value: "predictions"
      }
    }
  ]
}
